# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.22-s017_1 on Mon Jan 02 14:54:26 IST 2023

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design cpu

create_clock -name "clk" -period 20.0 -waveform {0.0 10.0} [list \
  [get_ports clk]  \
  [get_ports reset_n] ]
set_clock_transition 0.4 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports reset_n]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {data2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports is_halted]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {output_port[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {num_inst[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports writeM2]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports readM2]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {address1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports readM1]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells tsl18fs120_scl_ss/slbhb2]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/slbhb1]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/adiode]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/slbhb4]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/bh01d1]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/cload1]
